# 1	Вывести на экран 3 раза имя пользователя, от которого запускается команда.
# создадим файл с Bash-скриптом
cat > user3.sh
#!/bin/bash
for char in {1..3}
  do
      echo $USER
  done

# вывести на экран содержимое нового файла
cat user3.sh

# выполнить скрипт
bash user3.sh



# 2	Вывести с помощью цикла while все четные числа от 0 до 100 включительно.
# создадим файл с Bash-скриптом
cat > print100                                   
#! bin/bash/
x=0
while [ $x -lt 102 ]
do
      # echo $x # будет выводить каждое число в новой строке
      printf "${x} "
      let x+=2
      # x=$(( $x + 2 )) # то же присвоение, но в другом синтаксисе
done
echo "" \

# выполнить скрипт
bash user3.sh
